Revit 2027 API
Stairs.IsInEditMode Method
 Indicates whether the stairs is in edit mode or not.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsInEditMode()
Public Function IsInEditMode As Boolean
public:
bool IsInEditMode()
member IsInEditMode : unit -> bool
Return Value
Boolean
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace